
[
  {
    "id": "prod-001",
    "name": "SynergyOS",
    "category": "Software",
    "summary": "A revolutionary operating system designed for enterprise-level collaboration and productivity.",
    "description": "SynergyOS is our flagship product, a next-generation operating system built from the ground up to foster seamless collaboration. With its intuitive interface, powerful multitasking capabilities, and robust security features, SynergyOS is the backbone of modern, efficient enterprises.",
    "image": "https://placehold.co/600x400.png",
    "price": 499.99,
    "features": [
      "Real-time Collaboration Suite",
      "AI-Powered Workflow Automation",
      "Advanced Security Protocols",
      "Cross-Platform Compatibility"
    ]
  },
  {
    "id": "prod-002",
    "name": "ConnectHub",
    "category": "Software",
    "summary": "An all-in-one communication platform that unifies your team's conversations and workflows.",
    "description": "Break down communication silos with ConnectHub. This platform integrates messaging, video conferencing, and project management into a single, cohesive application. Keep your team aligned and projects on track, no matter where they are.",
    "image": "https://placehold.co/600x400.png",
    "price": 29.99,
    "features": [
      "Unified Messaging Channels",
      "HD Video & Audio Conferencing",
      "Task Management and Tracking",
      "Extensive Third-Party Integrations"
    ]
  },
  {
    "id": "prod-003",
    "name": "DataForge",
    "category": "Data Analytics",
    "summary": "A powerful data analytics tool that transforms raw data into actionable business insights.",
    "description": "Unlock the potential of your data with DataForge. Our platform provides powerful visualization tools, predictive analytics, and customizable dashboards to help you make data-driven decisions with confidence. From sales forecasting to customer behavior analysis, DataForge gives you the clarity you need.",
    "image": "https://placehold.co/600x400.png",
    "price": 999.00,
    "features": [
      "Interactive Data Visualization",
      "Predictive Analytics Engine",
      "Customizable Dashboards",
      "Secure Data Connectors"
    ]
  },
  {
    "id": "prod-004",
    "name": "SecureShield",
    "category": "Security",
    "summary": "Comprehensive cybersecurity suite to protect your digital assets from evolving threats.",
    "description": "In an increasingly hostile digital world, SecureShield is your fortress. We offer a multi-layered security solution that includes endpoint protection, network monitoring, and threat intelligence to safeguard your business against malware, ransomware, and phishing attacks.",
    "image": "https://placehold.co/600x400.png",
    "price": 750.50,
    "features": [
      "AI-based Threat Detection",
      "Endpoint Security and EDR",
      "24/7 Network Monitoring",
      "Employee Security Training Module"
    ]
  }
]
